results/saturate_ssd/cockroachdb/cockroachdb_maxthroughput_disk_swapoff_results/exp4_trial_9.txt
Adding shard node URL: jdbc:postgresql://10.0.0.16:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.16:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.16:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
[...]
Still waiting for thread Thread-177 to complete. Workload status: true
Still waiting for thread Thread-177 to complete. Workload status: true
Still waiting for thread Thread-177 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 337315
[OVERALL], Throughput(ops/sec), 67.73490654136342
[TOTAL_GCS_Copy], Count, 12
[TOTAL_GC_TIME_Copy], Time(ms), 91
[TOTAL_GC_TIME_%_Copy], Time(%), 0.026977750767087146
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 91
[TOTAL_GC_TIME_%], Time(%), 0.026977750767087146
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 61.2421875
[CLEANUP], MinLatency(us), 26
[CLEANUP], MaxLatency(us), 298
[CLEANUP], 99thPercentileLatency(us), 157
[CLEANUP], 99.9PercentileLatency(us), 298
[UPDATE], Operations, 22848
[UPDATE], AverageLatency(us), 3494186.1863182774
[UPDATE], MinLatency(us), 3746
[UPDATE], MaxLatency(us), 314048511
[UPDATE], 99thPercentileLatency(us), 17137663
[UPDATE], 99.9PercentileLatency(us), 200671231
[UPDATE], Return=OK, 22848