results/saturate_ssd/cockroachdb/cockroachdb_maxthroughput_disk_swapoff_results/exp5_trial_3.txt
Adding shard node URL: jdbc:postgresql://10.0.0.29:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.29:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.29:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
Still waiting for thread Thread-149 to complete. Workload status: true
Still waiting for thread Thread-99 to complete. Workload status: true
Still waiting for thread Thread-99 to complete. Workload status: true
Still waiting for thread Thread-99 to complete. Workload status: true
[...]
Still waiting for thread Thread-190 to complete. Workload status: true
Still waiting for thread Thread-190 to complete. Workload status: true
Still waiting for thread Thread-78 to complete. Workload status: true
[OVERALL], RunTime(ms), 322148
[OVERALL], Throughput(ops/sec), 190.974334777804
[TOTAL_GCS_Copy], Count, 13
[TOTAL_GC_TIME_Copy], Time(ms), 103
[TOTAL_GC_TIME_%_Copy], Time(%), 0.0319728820293778
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 103
[TOTAL_GC_TIME_%], Time(%), 0.0319728820293778
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 77.00390625
[CLEANUP], MinLatency(us), 30
[CLEANUP], MaxLatency(us), 352
[CLEANUP], 99thPercentileLatency(us), 210
[CLEANUP], 99.9PercentileLatency(us), 352
[UPDATE], Operations, 61522
[UPDATE], AverageLatency(us), 1244214.7311205748
[UPDATE], MinLatency(us), 802304
[UPDATE], MaxLatency(us), 96993279
[UPDATE], 99thPercentileLatency(us), 5263359
[UPDATE], 99.9PercentileLatency(us), 42074111
[UPDATE], Return=OK, 61522